installation_instructions.org
#+OPTIONS: \n:t

* Pre-installation
** Printing this guide from Emacs
Generate and export the txt file with "C-c C-e t l" then print it.

** BIOS update
Make sure that the latest BIOS update is installed (http://www.lenovo.com).

** BIOS settings
Make sure of the following:
Security > Secure Boot > Secure Boot > Disabled
Security > Virtualization > Intel (R) Virtualization Technology > Enabled

** Create the Arch installer USB
https://wiki.archlinux.org/index.php/USB_flash_installation_media

** References
General installation: https://wiki.archlinux.org/index.php/installation_guide
T470-specific installation: https://wiki.archlinux.org/index.php/Lenovo_ThinkPad_T470

* Main installation
** Boot from the Arch installer USB
Insert the USB key and press [Enter].

** Connect to the internet
An internet connection is required for installation. Plug in an ethernet cable and make sure you are connected to the internet:
> ping google.com

** Update the system clock
> timedatectl set-ntp true

** Partition the disks
> parted --align optimal /dev/nvme0n1
> mklabel gpt
> mkpart ESP fat32 1MiB 513MiB
> set 1 boot on
> mkpart primary ext4 513MiB 100%
> quit

** Format the boot partition
> mkfs.fat -F32 /dev/nvme0n1p1

** Encrypt and format the root partition
> cryptsetup luksFormat --type luks1 -vy /dev/nvme0n1p2
> cryptsetup open /dev/nvme0n1p2 cryptroot
> mkfs.ext4 /dev/mapper/cryptroot

** Mount the file systems
> mount /dev/mapper/cryptroot /mnt
> mkdir /mnt/boot
> mount /dev/nvme0n1p1 /mnt/boot

** Select the mirrors
Edit /etc/pacman.d/mirrorlist and put a suitable mirror at the top.

** Install the base packages and a bit more
> pacstrap /mnt base base-devel linux linux-firmware linux-lts networkmanager

Linux-LTS is installed as a backup kernel.

** Fstab
> genfstab -U /mnt >> /mnt/etc/fstab

NOTE: Check the resulting file in /mnt/etc/fstab and make sure it covers boot and root.

** Chroot
> arch-chroot /mnt

** Time zone
> ln -sf /usr/share/zoneinfo/Canada/Eastern /etc/localtime
> hwclock --systohc

** Locale
Uncomment en_CA.UTF-8 UTF-8 in /etc/locale.gen, then
> locale-gen
> echo LANG=en_CA.UTF-8 > /etc/locale.conf

** Hostname
> echo pholi-arch > /etc/hostname

In /etc/hosts, add:
127.0.0.1	localhost
::1		localhost
127.0.1.1	pholi-arch.localdomain pholi-arch

** Root password
> passwd

** Configure mkinitcpio and create the initramfs image
In /etc/mkinitcpio.conf, the hooks must be: HOOKS=(base udev autodetect keyboard keymap consolefont modconf block encrypt filesystems fsck)
> mkinitcpio -P

** Boot loader and Intel microcode
Install and configure GRUB:
> pacman -S grub efibootmgr

In /etc/default/grub:
- Uncomment GRUB_ENABLE_CRYPTODISK=y
- Uncomment GRUB_SAVEDEFAULT="true"
- Edit GRUB_DEFAULT to GRUB_DEFAULT=y
- Add the line GRUB_DISABLE_SUBMENU=y
> grub-install --target=x86_64-efi --efi-directory=/boot --bootloader-id=grub
> grub-mkconfig -o /boot/grub/grub.cfg

Find the UUID of /dev/nvme0n1p2:
> blkid

Edit /etc/default/grub and append the following line to GRUB_CMDLINE_LINUX_DEFAULT:
cryptdevice=UUID=the_uuid_found_earlier:cryptroot:allow-discards root=/dev/mapper/cryptroot

Add Intel microcode:
> pacman -S intel-ucode
> grub-mkconfig -o /boot/grub/grub.cfg

** Add user
> useradd -m pholi
> passwd pholi

Add pholi to sudoers:
> pacman -S vim
> visudo
  1. Go to the line starting with "root".
  2. Press [Y] twice to yank it.
  3. Go to the next line and press [P] to paste it.
  4. Use [X] to delete "root" from that line.
  5. Press [I] to enter insert mode, and replace the deleted "root" by "pholi".
  6. Press [Esc], then type ":wq", then press [Enter].

** Reboot
> exit
> umount -R /mnt
> cryptsetup close cryptroot
> shutdown now

Remove the Arch installer USB and power the computer back on.

** Internet
Find the wireless interface name (e.g., wlp4s0):
> ip link

Enable the wireless interface:
> sudo ip link set wlp4s0 up

NetworkManager will be used to manage connections:
> sudo pacman -S networkmanager
> sudo systemctl enable NetworkManager.service
> sudo systemctl start NetworkManager.service
> sudo systemctl mask systemd-resolved.service
Remove the /etc/resolv.conf file (if it exists), then:
> sudo echo "nameserver 8.8.8.8" > /etc/resolv.conf
In /etc/NetworkManager/NetworkManager.conf, under the [main] section (create it if it does not exist) add:
dns=none

*** Old method (above method fixes DNS problems)
> sudo pacman -S networkmanager
> sudo systemctl enable NetworkManager.service
> sudo systemctl start NetworkManager.service
> sudo systemctl enable systemd-resolved.service
> sudo systemctl start systemd-resolved.service
> sudo ln -sf /run/systemd/resolve/stub-resolv.conf /etc/resolv.conf

In the case of DNS problems, it is possible to hardcode the DNS server.
1. Mask the systemd service and remove the symlink:
   > sudo systemctl mask systemd-resolved.service
   > sudo rm /etc/resolv.conf
2. Manually create /etc/resolv.conf:
   > sudo touch /etc/resolv.conf
   > sudo echo "nameserver 8.8.8.8" > /etc/resolv.conf
3. Prevent NetworkManager from overwriting /etc/resolv.conf:
   > sudo chattr +i /etc/resolv.conf

** Dotfiles
> sudo pacman -S stow

To update all bash-related symlinks, for example, do:
> stow -d ~/dotfiles -t ~ -R bash

** Git
> sudo pacman -S git

Make sure that ~/.gitconfig is not present, then:
> stow -d ~/dotfiles -t ~ -R git

** yay
Install yay, an AUR helper:
> cd ~
> sudo pacman -S --asdeps go
> git clone https://aur.archlinux.org/yay.git
> cd yay
> makepkg -si
> cd ..
> rm -rf yay

Make sure that ~/.config/yay is not present, then:
> stow -d ~/dotfiles -t ~ -R yay

Note: Always get the non-git version of a package if possible. While non-git is not as bleeding edge as git, it is usually more stable.

** Fonts
To cover most characters:
> sudo pacman -S noto-fonts noto-fonts-cjk noto-fonts-extra ttf-dejavu ttf-liberation

Note: noto-fonts-emoji is not part of the installation, as displaying some of them in Emacs may cause a crash.

** Sound
> sudo pacman -S pulseaudio pulseaudio-alsa

** Video
> sudo pacman -S mesa

** Backlight
> sudo pacman -S light
> sudo usermod -a -G video pholi

** Touchpad
> sudo pacman -S xf86-input-libinput

Note: Put the backup file /etc/X11/xorg.conf.d/10-touchpad.conf.

** TRIM
> sudo systemctl enable fstrim.timer

