installation_instructions.txt


2.30 Passwords and encryption
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

  > sudo pacman -S gnupg pass

  Make sure that ~/.gnupg and ~/.password-store are not present, then:
  > stow -d ~/dotfiles -t ~ -R encryption


2.31 Terminal/bash
~~~~~~~~~~~~~~~~~~

  > sudo pacman -S xterm

  Make sure that ~/.profile and any ~/.bash* files are not
  present. Then:
  > stow -d ~/dotfiles -t ~ -R bash


2.32 Man pages
~~~~~~~~~~~~~~

  > sudo pacman -S man-db man-pages


2.33 Color profile
~~~~~~~~~~~~~~~~~~

  Source of the color profile:
  [https://www.notebookcheck.net/Lenovo-ThinkPad-T470-Core-i5-Full-HD-Notebook-Review.198130.0.html]

  > yay -S xcalib

  Note: The color profile is located in ~/scripts/data and the xcalib
  command is executed by ~/.config/i3/config.


2.34 X
~~~~~~

  Basic X packages:
  > sudo pacman -S xorg-server xorg-xinit xorg-xrdb

  Make sure that ~/.xinitrc and ~/.Xresources are not present. Then:
  > stow -d ~/dotfiles -t ~ -R x


2.35 XDG
~~~~~~~~

  > sudo pacman -S xdg-user-dirs

  Make sure that ~/.config/mimeapps.list, ~/.config/user-dirs.dir, and
  ~/.config/user-dirs.locale are not present. Then:
  > stow -d ~/dotfiles -t ~ -R xdg

  Once all backup files and documents are added:
  > xdg-user-dirs-update


2.36 i3
~~~~~~~

  Basic i3 package:
  > sudo pacman -S i3-wm

  Install i3blocks, a status bar:
  > sudo pacman -S i3blocks

  Make sure that ~/.config/i3 and ~/.config/i3blocks are not
  present. Then:
  > stow -d ~/dotfiles -t ~ -R i3

  Allow use of the special keys (volume, brightness, etc):
  > sudo yay -S xbindkeys

  For the lockscreen and suspend:
  > sudo pacman -S i3lock xautolock xdotool xorg-xdpyinfo xorg-xset
    xorg-xwininfo xss-lock

  Note: Put the backup file /etc/systemd/logind.conf for the custom
  screen locker.
  Note: The screen saver script is located in ~/scripts/startup, and is
  executed by ~/.config/i3/config.

  Install rofi, a lightweight menu, and mlocate to find files:
  > sudo pacman -S mlocate rofi

  For the calendar blocklet, install:
  > sudo pacman -S gsimplecal
  Make sure that ~/.config/gsimplecal is not present. Then:
  > stow -d ~/dotfiles -t ~ -R i3
  Note: gsimplecal config is in i3 since it is its only use case.

  For the pacman updates blocklet, install:
  > sudo pacman -S pacman-contrib

  For the battery blocklet, install:
  > sudo pacman -S acpi

  For the WiFi blocklet, install:
  > sudo pacman -S iw

  For the backup blocklet, install:
  > sudo pacman -S dialog

  For the idle blocklet, install:
  > sudo pacman -S xprintidle

  To take screenshots, install (shortcut F9 key):
  > sudo pacman -S lximage-qt
  Make sure that ~/.config/lximage-qt is not present. Then:
  > stow -d ~/dotfiles -t ~ -R lximage-qt

  For an external monitor, install (shortcut F7 key):
  > sudo pacman -S arandr
  Make sure that ~/.screenlayout is not present. Then:
  > stow -d ~/dotfiles -t ~ -R screenlayout

  For colorized output in pacman and yay, uncomment "Color" in
  /etc/pacman.conf.


3 Post-installation
===================

3.1 Thunar
~~~~~~~~~~

  Install additional packages:
  > sudo pacman -S thunar unrar unzip zip
  > sudo pacman -S --asdeps file-roller gvfs lrzip p7zip
    thunar-archive-plugin thunar-media-tags-plugin thunar-volman tumbler

  Make sure that ~/.config/Thunar and
  ~/.config/xfce4/xfconf/xfce-perchannel-xml/thunar.xml are not
  present. Then:
  > stow -d ~/dotfiles -t ~ -R thunar


3.2 Firefox
~~~~~~~~~~~

  > sudo pacman -S firefox

  Run Firefox once to generate a new profile, then exit it. Overwrite
  the files in ~/.mozilla/firefox/[profile] with those backed up.


3.3 Printing
~~~~~~~~~~~~

  For home:
  > yay -S brother-hl3170cdw
  > sudo pacman -S cups cups-pdf
  > sudo systemctl enable org.cups.cupsd.service
  > sudo systemctl start org.cups.cupsd.service
  > sudo gpasswd -a pholi lp
  > sudo gpasswd -a pholi sys
  > sudo gpasswd -a root lp
  > sudo gpasswd -a root sys

  For school (connect with USB, HP LaserJet 1320n):
  > yay -S hplip

  In browser, enter "localhost:631", then add the networked
  printer. Configure it and make it the default printer (Administration
  > Manage Printers > PrinterName > Set As Server Default).


3.4 Firewall
~~~~~~~~~~~~

  > sudo pacman -S ufw gufw
  > sudo systemctl enable ufw

  To access Gufw:
  > sudo gufw


3.5 Emacs
~~~~~~~~~

  > sudo pacman -S emacs

  Make sure that ~/.emacs.d is not present. Then:
  > stow -d ~/dotfiles -t ~ -R emacs


3.6 Email
~~~~~~~~~

  > sudo pacman -S isync msmtp msmtp-mta notmuch s-nail

  Make sure that ~/.mbsyncrc, ~/.msmtp.d, ~/.msmtprc, and
  ~/.notmuch-config are not present, and that ~/.mail is present, then:
  > stow -d ~/dotfiles -t ~ -R mail


3.7 Transmission
~~~~~~~~~~~~~~~~

  > sudo pacman -S transmission-gtk

  Make sure that ~/.config/transmission is not present, then:
  > stow -d ~/dotfiles -t ~ -R transmission


3.8 Commercial VPN
~~~~~~~~~~~~~~~~~~

  The commercial VPN is Mullvad. Install the required packages:
  > sudo pacman -S wireguard-tools wireguard-arch jq openresolv

  Follow the installation instructions:
  [https://mullvad.net/en/help/wireguard-and-mullvad-vpn/]


3.9 eduroam
~~~~~~~~~~~

  Security: WPA & WPA2 Enterprise
  Authentification: Protected EAP (PEAP)
  CA certificate: entrust_g2_ca.cer
  PEAP version: Automatic
  Inner authentication: MSCHAPv2
  Username: [username]@polymtl.ca
  Password: [password]

  Polymtl VPN:
  > sudo pacman -S networkmanager-openconnect

  To connect to the Polymtl VPN, execute the script
  ~/scripts/vpn_polymtl.sh


3.10 TLP
~~~~~~~~

  > sudo pacman -S tlp
  > sudo pacman -S --asdeps acpi_call ethtool smartmontools
    x86_energy_perf_policy
  > sudo systemctl enable tlp.service
  > sudo systemctl mask systemd-rfkill.service
  > sudo systemctl mask systemd-rfkill.socket


3.11 Okular
~~~~~~~~~~~

  > sudo pacman -S okular

  If prompted, choose phonon-qt5-vlc.

  It is not clear where okular stores all its settings. So, manually do:
  Settings > Show Toolbar: OFF
  Settings > Show Navigation Panel: OFF
  Settings > Configure Okular > General Options: Obey DRM limitations:
  OFF
  Settings > Configure Okular > General Options: Show hints and info
  messages: OFF
  Settings > Configure Okular > General Options: Open new files in tabs:
  ON
  Settings > Configure Okular > Annotations: Yellow highlighter, light
  blue highlighter, Pop-up Note, Inline Note


3.12 Security
~~~~~~~~~~~~~

  > sudo pacman -S arch-audit clamav rkhunter


3.13 CPLEX
~~~~~~~~~~

  Download the CPLEX binary from IBM, and make sure that it installs in
  /opt.

  > chmod +x cplex_studio1210.linux-x86-64.bin
  > sudo ./cplex_studio1210.linux-x86-64.bin


3.14 Audio recorder
~~~~~~~~~~~~~~~~~~~

  > yay -S audio-recorder

  Make sure that ~/.config/dconf/user is not present, then:
  > stow -d ~/dotfiles -t ~ -R audiorecorder


3.15 KVM
~~~~~~~~

  Make sure that everything is supported on the host machine:
  [https://wiki.archlinux.org/index.php/KVM]
  Concerning Virtio on the guest machine:
  [https://www.reddit.com/r/archlinux/comments/7t2dvp/virtio_modules_loaded/]

  Install QEMU:
  > sudo pacman -S qemu
  > sudo pacman -S --asdeps qemu-arch-extra qemu-block-gluster
    qemu-block-iscsi qemu-block-rbd

  Creating an image (size of 4G in this case):
  > qemu-img create -f raw my_image_name 4G

  Installing an OS on it (Debian in this case, with 2 cores and 4G RAM):
  > qemu-system-x86_64 -cdrom debian-10.2.0-amd64-netinst.iso -boot
    order=d -drive file=my_image_name,format=raw -smp 2 -m 4G

  Running a VM:
  > qemu-system-x86_64 -boot order=c -drive
    file=my_image_name,format=raw -smp 2 -m 4G


3.16 cmus
~~~~~~~~~

  > sudo pacman -S cmus

  Install all optional dependencies as dependencies.

  Make sure that ~/.config/cmus is not present, then:
  > stow -d ~/dotfiles -t ~ -R cmus


3.17 htop
~~~~~~~~~

  > sudo pacman -S htop

  Make sure that ~/.config/htop is not present, then:
  > stow -d ~/dotfiles -t ~ -R htop


3.18 LibreOffice
~~~~~~~~~~~~~~~~

  > sudo pacman -S libreoffice-still

  Make sure that ~/.config/libreoffice is not present, then:
  > stow -d ~/dotfiles -t ~ -R libreoffice


3.19 SSH
~~~~~~~~

  > sudo pacman -S openssh sshpass

  Make sure that ~/.ssh is not present, then:
  > stow -d ~/dotfiles -t ~ -R ssh


3.20 LaTeX
~~~~~~~~~~
