installation_instructions.txt

  > sudo pacman -S biber texlive-most
  > yay -S auctex jabref

  rendu ici, quelles configs?
  Remove these?: biber, jabref


3.21 VLC
~~~~~~~~

  > sudo pacman -S vlc

  Make sure that ~/.config/vlc is not present, then:
  > stow -d ~/dotfiles -t ~ -R vlc


3.22 Python
~~~~~~~~~~~

  > sudo pacman -S python-matplotlib python-networkx python-numpy
    python-pandas python-pillow python-pip python-scikit-learn
    python-scipy


3.23 Other packages
~~~~~~~~~~~~~~~~~~~

3.23.1 Partitioning and file systems
------------------------------------

  > sudo pacman -S parted gparted ntfs-3g
  > sudo pacman -S --asdeps dosfstools exfat-utils
  > yay -S hfsprogs


3.23.2 Other utilities
----------------------

  > sudo pacman -S curl dos2unix rsync udisks2 valgrind wget youtube-dl


3.23.3 Old applications (don't install by default)
--------------------------------------------------

  discord
  zoom
  kodi
  inkscape (SVG editor)
  pinta (graphics editor)
  textext (AUR) (LaTeX extension for Inkscape) and its dependencies:
  python2-lxml pstoedit


4 Notes
=======

4.1 Changing the MAC address
~~~~~~~~~~~~~~~~~~~~~~~~~~~~

  Find the wifi interface (e.g., wlp4s0):
  > ip link

  Install macchanger:
  > sudo pacman -S macchanger

  Set the interface down, change to a random MAC address, and set the
  interface up:
  > sudo ip link set dev wlp4s0 down
  > macchanger -r wlp4s0
  > sudo ip link set dev wlp4s0 up

  To put back the original MAC address:
  > sudo ip link set dev wlp4s0 down
  > macchanger -p wlp4s0
  > sudo ip link set dev wlp4s0 up


4.2 pacman
~~~~~~~~~~

  Installing packages:
  > sudo pacman -S [packages]

  Updating packages:
  > sudo pacman -Syu

  Removing and purging packages:
  > sudo pacman -Rns [packages]

  Displaying a list of unused packages (orphans):
  > pacman -Qtdq

  Removing unused packages (orphans):
  > sudo pacman -Rns $(pacman -Qtdq)

  Pacman report:
  > sudo pacman -S pacutils
  > pacreport

  Cleaning pacman cache:
  > sudo pacman -S pacman-contrib
  > paccache -r


4.3 yay
~~~~~~~

  Updating packages:
  > yay -Syu --devel


4.4 Misc.
~~~~~~~~~

  Cannot write on external hard drive: [https://askubuntu.com/a/172671]


4.5 Accessing an external encrypted HD
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

  Find the path of the partition (e.g., /dev/sdc1)
  > lsblk

  Open:
  > sudo mount /dev/sdc1 /mnt
  > sudo cryptsetup luksOpen /mnt/backup.luks myluks
  > sudo mkdir /mnt/myluks
  > sudo mount /dev/mapper/myluks /mnt/myluks

  Close:
  > sudo umount /mnt/myluks
  > sudo cryptsetup luksClose /dev/mapper/myluks
  > sudo rmdir /mnt/myluks
  > udisksctl unmount -b /dev/sdc1
  > udisksctl power-off -b /dev/sdc1


4.6 Chroot into the system
~~~~~~~~~~~~~~~~~~~~~~~~~~

  Insert the Arch USB, reboot and press [Enter] to boot with the Arch
  installer.

  Find the paths of the partitions (e.g., /dev/nvme0n1p1 for boot and
  /dev/nvme0n1p2 for root):
  > lsblk

  > cryptsetup open --type luks1 /dev/nvme0n1p2 cryptroot
  > mount -t ext4 /dev/mapper/cryptroot /mnt
  > mount -t vfat /dev/nvme0n1p1 /mnt/boot
  > arch-chroot /mnt

  To leave:
  > exit
  > umount -R /mnt/boot
  > umount -R /mnt
  > cryptsetup close cryptroot


4.7 Downgrading packages
~~~~~~~~~~~~~~~~~~~~~~~~

  [https://wiki.archlinux.org/index.php/downgrading_packages]
